[M_ThresherRaid MissionDefinition]
MissionName="You will die... (seriously))"
MissionDescription="Patricia Tans asks you to defeat the most dangerous killer named Terramorph. He is said to be the best pirate in Pandora. It is also said that it takes a team of four to defeat him.."
TurnInDescription="Thermomorph is off! unbelievable!"
MissionSummary="Kill the horrible Terasorb."
MissionGiver="Patricia Tanis"
MissionTurnInLocation="dirty-"
TeaserText="attack!"

[M_ThresherRaid:HeadToLair MissionObjectiveDefinition]
ProgressMessage="Go to the thermomorph below"

[M_ThresherRaid:HeadToLair_ObjSet1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ThresherRaid:HeadToLair_ObjSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ThresherRaid:KillThresherBoss MissionObjectiveDefinition]
ProgressMessage="Kill the Terramorph"

[M_ThresherRaid:KillThresherBoss_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ThresherRaid:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ThresherRaid:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ThresherRaid:OpenThresherLair MissionObjectiveDefinition]
ProgressMessage="Open Terramorph line"

[M_ThresherRaid:SummonThresher MissionObjectiveDefinition]
ProgressMessage="Press the button"

